Removed ascii state machine
